<template>
  <div class="home">
    <div class="hero">
      <svg
        width="845"
        height="173"
        viewBox="0 0 845 173"
        fill="none"
        xmlns="http://www.w3.org/2000/svg"
      >
        <path
          d="M82.9001 0.519989V25.72H26.2001V55.78H75.3401V80.98H26.2001V133H0.100098V0.519989H82.9001Z"
          fill="#F65C8A"
        />
        <path
          d="M90.5628 92.68C90.5628 84.64 92.4228 77.44 96.1428 71.08C99.9828 64.72 105.323 59.74 112.163 56.14C119.123 52.42 126.983 50.56 135.743 50.56C144.503 50.56 152.183 52.42 158.783 56.14C165.503 59.74 170.663 64.72 174.263 71.08C177.863 77.44 179.663 84.64 179.663 92.68C179.663 100.72 177.863 107.98 174.263 114.46C170.663 120.94 165.503 126.04 158.783 129.76C152.183 133.36 144.383 135.16 135.383 135.16C126.623 135.16 118.823 133.48 111.983 130.12C105.263 126.64 99.9828 121.72 96.1428 115.36C92.4228 109 90.5628 101.44 90.5628 92.68ZM115.943 92.86C115.943 99.1 117.743 104.32 121.343 108.52C124.943 112.6 129.503 114.64 135.023 114.64C140.783 114.64 145.403 112.6 148.883 108.52C152.483 104.44 154.283 99.22 154.283 92.86C154.283 86.5 152.483 81.28 148.883 77.2C145.403 73.12 140.783 71.08 135.023 71.08C129.503 71.08 124.943 73.18 121.343 77.38C117.743 81.46 115.943 86.62 115.943 92.86Z"
          fill="#F65C8A"
        />
        <path
          d="M224.175 72.34C226.335 68.14 229.275 64.36 232.995 61C236.835 57.64 240.735 55.06 244.695 53.26C248.655 51.34 251.775 50.38 254.055 50.38L252.795 75.58C252.075 75.46 251.055 75.4 249.735 75.4C244.695 75.4 240.255 76.72 236.415 79.36C232.575 82 229.635 85.42 227.595 89.62C225.555 93.7 224.535 97.9 224.535 102.22V133H199.515V54.34H222.195L224.175 72.34Z"
          fill="#F65C8A"
        />
        <path
          d="M418.818 0.519989V25.72H362.118V55.78H411.258V80.98H362.118V133H336.018V0.519989H418.818Z"
          fill="#F65C8A"
        />
        <path
          d="M465.008 54.34V133H439.808V54.34H465.008ZM439.268 26.44C439.268 22.84 440.648 19.84 443.408 17.44C446.288 14.92 449.528 13.66 453.128 13.66C456.608 13.66 459.728 14.92 462.488 17.44C465.248 19.84 466.628 22.84 466.628 26.44C466.628 30.04 465.248 33.04 462.488 35.44C459.728 37.84 456.608 39.04 453.128 39.04C449.528 39.04 446.288 37.84 443.408 35.44C440.648 33.04 439.268 30.04 439.268 26.44Z"
          fill="#F65C8A"
        />
        <path
          d="M578.98 54.34V133C578.98 140.44 576.82 147.16 572.5 153.16C568.3 159.28 562.54 164.02 555.22 167.38C548.02 170.86 540.16 172.6 531.64 172.6C525.16 172.6 519.46 171.82 514.54 170.26C509.74 168.7 505.84 166.96 502.84 165.04C499.96 163.12 496.48 160.48 492.4 157.12L507.16 139.84C510.76 143.2 514.3 145.84 517.78 147.76C521.38 149.68 525.88 150.64 531.28 150.64C537.64 150.64 542.98 149.02 547.3 145.78C551.62 142.66 553.78 138.28 553.78 132.64V121.48C551.38 125.56 547.66 128.86 542.62 131.38C537.7 133.9 531.64 135.16 524.44 135.16C517.36 135.16 510.76 133.36 504.64 129.76C498.64 126.04 493.84 121 490.24 114.64C486.64 108.16 484.84 101.02 484.84 93.22C484.84 85.3 486.7 78.04 490.42 71.44C494.26 64.84 499.24 59.68 505.36 55.96C511.6 52.24 518.14 50.38 524.98 50.38C531.46 50.38 537.22 51.34 542.26 53.26C547.3 55.06 551.14 57.46 553.78 60.46L555.76 54.34H578.98ZM532 114.64C542.08 114.64 549.34 110.68 553.78 102.76V83.5C552.1 79.66 549.28 76.6 545.32 74.32C541.48 72.04 537.04 70.9 532 70.9C525.88 70.9 520.72 72.94 516.52 77.02C512.32 81.1 510.22 86.26 510.22 92.5C510.22 98.74 512.32 104.02 516.52 108.34C520.72 112.54 525.88 114.64 532 114.64Z"
          fill="#F65C8A"
        />
        <path
          d="M708.546 50.38C716.226 50.38 722.346 52.54 726.906 56.86C731.586 61.18 734.046 66.88 734.286 73.96V133H709.266V84.4C709.026 80.44 708.366 77.5 707.286 75.58C706.206 73.54 704.106 72.4 700.986 72.16C695.106 72.16 690.486 75.04 687.126 80.8C683.886 86.44 682.266 93.1 682.266 100.78V133H657.066V84.4C656.826 80.44 656.106 77.5 654.906 75.58C653.706 73.54 651.486 72.4 648.246 72.16C642.606 72.16 638.166 75.04 634.926 80.8C631.686 86.44 630.066 92.98 630.066 100.42V133H604.866V54.34H627.726L629.526 66.76C635.886 55.84 645.366 50.38 657.966 50.38C664.326 50.38 669.546 51.7 673.626 54.34C677.826 56.86 680.706 60.64 682.266 65.68C685.626 61 689.586 57.28 694.146 54.52C698.826 51.76 703.626 50.38 708.546 50.38Z"
          fill="#F65C8A"
        />
        <path
          d="M844.857 54.34V133H819.657V123.28C812.097 131.2 803.337 135.16 793.377 135.16C781.737 135.16 772.257 131.68 764.937 124.72C757.737 117.76 754.137 107.44 754.137 93.76C754.137 85.12 755.877 77.56 759.357 71.08C762.957 64.48 767.697 59.38 773.577 55.78C779.457 52.18 785.757 50.38 792.477 50.38C799.437 50.38 804.957 51.46 809.037 53.62C813.117 55.66 816.717 58.6 819.837 62.44L821.457 54.34H844.857ZM800.577 114.64C809.337 114.64 815.697 110.68 819.657 102.76V83.5C818.217 79.66 815.697 76.6 812.097 74.32C808.617 72.04 804.477 70.9 799.677 70.9C794.157 70.9 789.417 72.94 785.457 77.02C781.617 81.1 779.697 86.26 779.697 92.5C779.697 96.58 780.657 100.36 782.577 103.84C784.497 107.2 787.017 109.84 790.137 111.76C793.377 113.68 796.857 114.64 800.577 114.64Z"
          fill="#F65C8A"
        />
        <mask
          id="mask0"
          mask-type="alpha"
          maskUnits="userSpaceOnUse"
          x="0"
          y="0"
          width="845"
          height="173"
        >
          <path
            d="M82.9001 0.519989V25.72H26.2001V55.78H75.3401V80.98H26.2001V133H0.100098V0.519989H82.9001Z"
            fill="#F65C8A"
          />
          <path
            d="M90.5628 92.68C90.5628 84.64 92.4228 77.44 96.1428 71.08C99.9827 64.72 105.323 59.74 112.163 56.14C119.123 52.42 126.983 50.56 135.743 50.56C144.503 50.56 152.183 52.42 158.783 56.14C165.503 59.74 170.663 64.72 174.263 71.08C177.863 77.44 179.663 84.64 179.663 92.68C179.663 100.72 177.863 107.98 174.263 114.46C170.663 120.94 165.503 126.04 158.783 129.76C152.183 133.36 144.383 135.16 135.383 135.16C126.623 135.16 118.823 133.48 111.983 130.12C105.263 126.64 99.9827 121.72 96.1428 115.36C92.4228 109 90.5628 101.44 90.5628 92.68ZM115.943 92.86C115.943 99.1 117.743 104.32 121.343 108.52C124.943 112.6 129.503 114.64 135.023 114.64C140.783 114.64 145.403 112.6 148.883 108.52C152.483 104.44 154.283 99.22 154.283 92.86C154.283 86.5 152.483 81.28 148.883 77.2C145.403 73.12 140.783 71.08 135.023 71.08C129.503 71.08 124.943 73.18 121.343 77.38C117.743 81.46 115.943 86.62 115.943 92.86Z"
            fill="#F65C8A"
          />
          <path
            d="M224.175 72.34C226.335 68.14 229.275 64.36 232.995 61C236.835 57.64 240.735 55.06 244.695 53.26C248.655 51.34 251.775 50.38 254.055 50.38L252.795 75.58C252.075 75.46 251.055 75.4 249.735 75.4C244.695 75.4 240.255 76.72 236.415 79.36C232.575 82 229.635 85.42 227.595 89.62C225.555 93.7 224.535 97.9 224.535 102.22V133H199.515V54.34H222.195L224.175 72.34Z"
            fill="#F65C8A"
          />
          <path
            d="M418.818 0.519989V25.72H362.118V55.78H411.258V80.98H362.118V133H336.018V0.519989H418.818Z"
            fill="#F65C8A"
          />
          <path
            d="M465.008 54.34V133H439.808V54.34H465.008ZM439.268 26.44C439.268 22.84 440.648 19.84 443.408 17.44C446.288 14.92 449.528 13.66 453.128 13.66C456.608 13.66 459.728 14.92 462.488 17.44C465.248 19.84 466.628 22.84 466.628 26.44C466.628 30.04 465.248 33.04 462.488 35.44C459.728 37.84 456.608 39.04 453.128 39.04C449.528 39.04 446.288 37.84 443.408 35.44C440.648 33.04 439.268 30.04 439.268 26.44Z"
            fill="#F65C8A"
          />
          <path
            d="M578.98 54.34V133C578.98 140.44 576.82 147.16 572.5 153.16C568.3 159.28 562.54 164.02 555.22 167.38C548.02 170.86 540.16 172.6 531.64 172.6C525.16 172.6 519.46 171.82 514.54 170.26C509.74 168.7 505.84 166.96 502.84 165.04C499.96 163.12 496.48 160.48 492.4 157.12L507.16 139.84C510.76 143.2 514.3 145.84 517.78 147.76C521.38 149.68 525.88 150.64 531.28 150.64C537.64 150.64 542.98 149.02 547.3 145.78C551.62 142.66 553.78 138.28 553.78 132.64V121.48C551.38 125.56 547.66 128.86 542.62 131.38C537.7 133.9 531.64 135.16 524.44 135.16C517.36 135.16 510.76 133.36 504.64 129.76C498.64 126.04 493.84 121 490.24 114.64C486.64 108.16 484.84 101.02 484.84 93.22C484.84 85.3 486.7 78.04 490.42 71.44C494.26 64.84 499.24 59.68 505.36 55.96C511.6 52.24 518.14 50.38 524.98 50.38C531.46 50.38 537.22 51.34 542.26 53.26C547.3 55.06 551.14 57.46 553.78 60.46L555.76 54.34H578.98ZM532 114.64C542.08 114.64 549.34 110.68 553.78 102.76V83.5C552.1 79.66 549.28 76.6 545.32 74.32C541.48 72.04 537.04 70.9 532 70.9C525.88 70.9 520.72 72.94 516.52 77.02C512.32 81.1 510.22 86.26 510.22 92.5C510.22 98.74 512.32 104.02 516.52 108.34C520.72 112.54 525.88 114.64 532 114.64Z"
            fill="#F65C8A"
          />
          <path
            d="M708.546 50.38C716.226 50.38 722.346 52.54 726.906 56.86C731.586 61.18 734.046 66.88 734.286 73.96V133H709.266V84.4C709.026 80.44 708.366 77.5 707.286 75.58C706.206 73.54 704.106 72.4 700.986 72.16C695.106 72.16 690.486 75.04 687.126 80.8C683.886 86.44 682.266 93.1 682.266 100.78V133H657.066V84.4C656.826 80.44 656.106 77.5 654.906 75.58C653.706 73.54 651.486 72.4 648.246 72.16C642.606 72.16 638.166 75.04 634.926 80.8C631.686 86.44 630.066 92.98 630.066 100.42V133H604.866V54.34H627.726L629.526 66.76C635.886 55.84 645.366 50.38 657.966 50.38C664.326 50.38 669.546 51.7 673.626 54.34C677.826 56.86 680.706 60.64 682.266 65.68C685.626 61 689.586 57.28 694.146 54.52C698.826 51.76 703.626 50.38 708.546 50.38Z"
            fill="#F65C8A"
          />
          <path
            d="M844.857 54.34V133H819.657V123.28C812.097 131.2 803.337 135.16 793.377 135.16C781.737 135.16 772.257 131.68 764.937 124.72C757.737 117.76 754.137 107.44 754.137 93.76C754.137 85.12 755.877 77.56 759.357 71.08C762.957 64.48 767.697 59.38 773.577 55.78C779.457 52.18 785.757 50.38 792.477 50.38C799.437 50.38 804.957 51.46 809.037 53.62C813.117 55.66 816.717 58.6 819.837 62.44L821.457 54.34H844.857ZM800.577 114.64C809.337 114.64 815.697 110.68 819.657 102.76V83.5C818.217 79.66 815.697 76.6 812.097 74.32C808.617 72.04 804.477 70.9 799.677 70.9C794.157 70.9 789.417 72.94 785.457 77.02C781.617 81.1 779.697 86.26 779.697 92.5C779.697 96.58 780.657 100.36 782.577 103.84C784.497 107.2 787.017 109.84 790.137 111.76C793.377 113.68 796.857 114.64 800.577 114.64Z"
            fill="#F65C8A"
          />
        </mask>
        <g mask="url(#mask0)">
          <g filter="url(#filter0_f)">
            <ellipse cx="-54" cy="-234.5" rx="392" ry="392.5" fill="#5F5CF6" />
          </g>
          <g filter="url(#filter1_f)">
            <ellipse
              cx="647.5"
              cy="-111.5"
              rx="319.5"
              ry="260.5"
              fill="#00B5FF"
            />
          </g>
        </g>
        <defs>
          <filter
            id="filter0_f"
            x="-526"
            y="-707"
            width="944"
            height="945"
            filterUnits="userSpaceOnUse"
            color-interpolation-filters="sRGB"
          >
            <feFlood flood-opacity="0" result="BackgroundImageFix" />
            <feBlend
              mode="normal"
              in="SourceGraphic"
              in2="BackgroundImageFix"
              result="shape"
            />
            <feGaussianBlur stdDeviation="40" result="effect1_foregroundBlur" />
          </filter>
          <filter
            id="filter1_f"
            x="248"
            y="-452"
            width="799"
            height="681"
            filterUnits="userSpaceOnUse"
            color-interpolation-filters="sRGB"
          >
            <feFlood flood-opacity="0" result="BackgroundImageFix" />
            <feBlend
              mode="normal"
              in="SourceGraphic"
              in2="BackgroundImageFix"
              result="shape"
            />
            <feGaussianBlur stdDeviation="40" result="effect1_foregroundBlur" />
          </filter>
        </defs>
      </svg>
      <div class="ScrollWrap">
        <ScrollText class="ScrollText1" />
        <ScrollText class="ScrollText2" />
      </div>
      <Slogan class="Slogan" />
    </div>
    <nav>
      <Logo class="Logo" />
      <div class="links">
        <a
          :href="item"
          v-for="(item, index) in cnLang.nav"
          :key="index"
          :id="item"
          >{{ item }}</a
        >
      </div>
    </nav>
    <section class="section-1">
      <Title :title="this.cnLang.title[0]" :des="this.cnLang.des[0]">
        <TitleIcon1 />
      </Title>
      <div class="cardWrap">
        <Card
          title="Figma.Cool"
          info="资源、插件推荐、教程文章"
          des="Figma.Cool 是一个有着众多高质量 Figma 资源、插件和教程文章的Figma 共享平台。"
          imgSrc="/imgs/card-logo-1.svg"
          bgColor="background: var(--color-red-1)"
          rightSrc="/imgs/card-right-1.svg"
          href="https://ui.figma.cool"
        />
        <Card
          title="FigmaCN"
          info="Figma 客户端汉化补丁、 Chrome 插件"
          des="现在，你可以使用客户端汉化补丁和 Chrome 浏览器插件来使 Figma 支持中文界面。"
          imgSrc="/imgs/card-logo-2.svg"
          bgColor="background: var(--color-purple-1)"
          rightSrc="/imgs/card-right-2.svg"
        />
      </div>
    </section>
    <section class="section-2">
      <Title :title="this.cnLang.title[1]" :des="this.cnLang.des[1]">
        <TitleIcon2 />
      </Title>
      <div class="cardWrap">
        <div class="left">
          <PluginCard
            title="Chinese Font Picker"
            info="中文字体选择器"
            des="现在你可以在 Figma 里使用中文字体选择器选择和预览系统中已安装的中文字体。"
            imgSrc="/imgs/plugin-icon-1.svg"
            rightSrc="/imgs/plugin-1.png"
            href="https://www.figma.com/community/plugin/851126455550003999/Chinese-Font-Picker"
          />
          <PluginCard
            title="Same Text Generator"
            info="一键替换多个相同文本"
            des="现在你可以在 Figma 里使用中文字体选择器选择和预览系统中已安装的中文字体。"
            imgSrc="/imgs/plugin-icon-3.svg"
            rightSrc="/imgs/plugin-3.png"
            href="https://www.figma.com/community/plugin/863748474013054025/Same-Text-Generator"
          />
        </div>
        <div class="right">
          <PluginCard
            title="Chinese User Data Generator"
            info="中文用户数据生成器"
            des="现在你可以在 Figma 里使用中文字体选择器选择和预览系统中已安装的中文字体。"
            imgSrc="/imgs/plugin-icon-2.svg"
            rightSrc="/imgs/plugin-2.png"
            href="https://www.figma.com/community/plugin/864052338727969891/Chinese-User-Data-Generator"
          />
          <PluginCard
            title="Unlocker"
            info="锁定图层快速定位解锁"
            des="现在你可以在 Figma 里使用中文字体选择器选择和预览系统中已安装的中文字体。"
            imgSrc="/imgs/plugin-icon-4.svg"
            rightSrc="/imgs/plugin-4.png"
            href="https://www.figma.com/community/plugin/862912103841000337/Unlocker"
          />
        </div>
      </div>
    </section>
    <div class="HIDDEN">
      <TitleIcon1 />
      <TitleIcon2 />
      <TitleIcon3 />
      <TitleIcon4 />
    </div>
  </div>
</template>

<script>
import ScrollText from "../assets/hero-scroll.svg"
import Slogan from "../assets/hero-slogan.svg"
import Logo from "../assets/hero-logo.svg"
import Title from "@/components/Title"
import Card from "@/components/Card"
import PluginCard from "@/components/PluginCard"
import TitleIcon1 from "../assets/title-1.svg"
import TitleIcon2 from "../assets/title-2.svg"
import TitleIcon3 from "../assets/title-3.svg"
import TitleIcon4 from "../assets/title-4.svg"

export default {
  name: "Home",
  components: {
    ScrollText,
    Slogan,
    Logo,
    Title,
    TitleIcon1,
    TitleIcon2,
    TitleIcon3,
    TitleIcon4,
    Card,
    PluginCard
  },
  data () {
    return {
      cnLang: {
        nav: ["Figma 中文计划", "Figma 插件", "我们的故事"],
        title: ["Figma 中文计划", "Figma 插件"],
        des: ["为中文母语使用者提供便捷", "持续的创造，全部开源"]
      }
    }
  }
}
</script>

<style lang="scss" scoped>
.home {
  width: 100vw;
  overflow-x: hidden;
  display: flex;
  flex-direction: column;
  align-items: center;

  .hero {
    position: relative;
    width: 100vw;
    max-width: calc(1340px - 160px);
    margin: 0 80px;
    text-align: left;
    padding: var(--mg-3) 0;

    .ScrollWrap {
      z-index: -1;
      position: absolute;
      top: 240px;
      display: flex;
      left: -50%;

      .ScrollText2 {
        margin-left: 56px;
      }

      .ScrollText1,
      .ScrollText2 {
        animation: scrollText 10s linear infinite;

        @keyframes scrollText {
          to {
            transform: translateX(-50%);
          }
        }
      }
    }

    .Slogan {
      margin-top: 120px;
    }
  }
  nav {
    position: relative;
    display: flex;
    flex-direction: column;
    align-items: center;
    width: 100vw;

    &::before {
      position: absolute;
      left: 0;
      bottom: -24px;
      content: "";
      display: block;
      width: 100%;
      height: 1px;
      background: var(--color-gradient-1);
    }

    a {
      font-weight: 500;
      font-size: 16px;
      line-height: 16px;
      margin: 0 40px 0 0;

      &:last-child {
        margin: 0;
      }
    }
  }

  .Logo {
    margin: 0 0 var(--mg-4) 0;
  }

  .section-1 {
    display: flex;
    flex-direction: column;
    align-items: center;
    width: 100vw;
    padding: var(--mg-1) 0;
    margin-top: 24px;
    background-color: var(--color-black-2);

    .cardWrap {
      width: 100%;
      max-width: calc(1340px - 160px);
      margin: 0 80px;
      display: flex;
      justify-content: space-between;
      margin-top: var(--mg-2);

      .card {
        max-width: calc(50% - 10px);
      }
    }
  }

  .section-2 {
    display: flex;
    flex-direction: column;
    align-items: center;
    width: 100vw;
    margin-top: 24px;

    .cardWrap {
      width: 100%;
      max-width: calc(1340px - 160px);
      margin: 0 80px;
      display: flex;
      justify-content: space-between;
      margin-top: var(--mg-2);

      .left,
      .right {
        width: 100%;
        max-width: calc(50% - 10px);
      }

      .card {
        margin-bottom: 20px;
      }
    }
  }
}

.HIDDEN {
  display: none;
}
</style>
